Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NoOutputNode Property
 The calculation could not be executed as configured. Select an output node before analyzing this network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NoOutputNode { get; }
Public Shared ReadOnly Property Network_NoOutputNode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NoOutputNode {
	FailureDefinitionId^ get ();
}
static member Network_NoOutputNode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace